****** Answer
       #+BEGIN_SRC awk :in-file data/election_data :results pp :exports both
         BEGIN  { FIELDWIDTHS = "18 9 15" }

         NR > 2 {
             if ($2 ~ "x") {
                 gore++
             } else if ($3 ~ "x") {
                 bush++
             } else {
                 abstained++
             }
         }

         END { print "Bush:", bush, "Gore:", gore, "Abstained:", abstained }
       #+END_SRC

       #+RESULTS:
       : Bush: 9 Gore: 10 Abstained: 1

****** Answer
       #+BEGIN_SRC awk :in-file data/tcdrain.c :results pp :exports both
       {
           while ((i = index($0, "/*")) != 0) {
               out = substr($0, 1, i - 1)  # leading part of the string
               rest = substr($0, i + 2)    # ... */ ...
               j = index(rest, "*/")       # is */ in trailing part?
               if (j > 0) {
                   rest = substr(rest, j + 2)  # remove comment
               } else {
                   while (j == 0) {
                       # get more text
                       if (getline <= 0) {
                           print("unexpected EOF or error:", ERRNO) > "/dev/stderr"
                           exit
                       }
                       # build up the line using string concatenation
                       rest = rest $0
                       j = index(rest, "*/")   # is */ in trailing part?
                       if (j != 0) {
                           rest = substr(rest, j + 2)
                           break
                       }
                   }
               }
               # build up the output line using string concatenation
               $0 = out rest
           }
           print $0
       }
       #+END_SRC

       #+RESULTS:
       #+begin_example

       #include <errno.h>
       #include <termios.h>

       int __set_errno(int n) { return n; }

       int __libc_tcdrain (int fd) {
         if (fd < 0) {
             __set_errno (EBADF);
             return -1;
           }
          __set_errno (ENOSYS);
         return -1;
       }
   #+end_example

**** #1
     #+BEGIN_QUOTE
     Rewrite the program:
     #+BEGIN_SRC awk :in-file data/inventory-shipped :results pp :exports both
     BEGIN { print "Month Crates"; print "----- ------" }
     { print $1, "     ", $2 }
     #+END_SRC

     #+RESULTS:
     : Month Crates
     : ----- ------
     : Jan       13
     : Feb       15
     : Mar       15
     : Aug       11
     : Sep       25
     : Dec       6

     from Output Separators, by using a new value of OFS.
     #+END_QUOTE

****** Answer
       #+BEGIN_SRC awk :in-file data/inventory-shipped :results pp :exports both
       BEGIN { print "Month Crates"; print "----- ------"; OFS="     " }
       { print $1, $2 }
       #+END_SRC

       #+RESULTS:
       : Month Crates
       : ----- ------
       : Jan     13
       : Feb     15
       : Mar     15
       : Aug     11
       : Sep     25
       : Dec     6
****** ~zerofile.awk~
       #+BEGIN_SRC awk :in-file data/empty data/empty1 :results pp :exports both
       BEGIN { Argind = 0 }

       ARGIND > Argind + 1 {
           for (Argind++; Argind < ARGIND; Argind++)
               print(ARGV[Argind], Argind)
       }

       ARGIND != Argind { Argind = ARGIND }

       END {
           if (ARGIND > Argind)
               for (Argind++; Argind <= ARGIND; Argind++)
                   print(ARGV[Argind])
       }
       #+END_SRC

       #+RESULTS:
       : data/empty 1
       : data/empty1 2

****** Answer
       Use ~ENDFILE~ to run a function at the end of each file. You could match
       ~argc~/~argv~ as well if you wanted to determine the index of the filename
       argument.

       #+BEGIN_SRC awk :in-file data/empty data/empty1 :results pp :exports both
       ENDFILE { print(FILENAME, ++argi) }
       #+END_SRC

       #+RESULTS:
       : data/empty 1
       : data/empty1 2
**** #2
     As a related challenge, revise that code to handle the case where an
     intervening value in ~ARGV~ is a variable assignment.

       #+BEGIN_SRC awk :cmd-line "--assign=nval=9" :in-file data/empty data/empty1 :results pp :exports both
       ENDFILE {
         if (argv[argi++] !~ /^[a-zA-Z_][a-zA-Z0-9_]*=.*/) {
             print(FILENAME, argi)
         }
       }
       #+END_SRC

       #+RESULTS:
       : data/empty 1
       : data/empty1 2
****** Answer
       #+BEGIN_SRC awk :results pp :exports both
         # id.awk --- implement id in awk
         #
         # Requires user and group library functions
         # output is:
         # uid=12(foo) euid=34(bar) gid=3(baz) \
         #             egid=5(blat) groups=9(nine),2(two),1(one)
         @include "vendor/group.awk"
         @include "vendor/passwd.awk"
         @include "vendor/getopt.awk"

         BEGIN {
             if (ARGC < 2) {
                 print_uid++
                 print_egid++
                 print_groups++
             } else {
                 while ((c = getopt(ARGC, ARGV, "gGnru")) != -1) {
                     if (c == "g") { print_gid++ }
                     else if (c == "G") { print_groups++ }
                     else if (c == "u") { print_uid++ }
                 }
             }

             uid = PROCINFO["uid"]
             euid = PROCINFO["euid"]
             gid = PROCINFO["gid"]
             egid = PROCINFO["egid"]

             if (print_uid)
                 printf("uid=%d", uid)
             pw = getpwuid(uid)
             pr_first_field(pw)

             if (print_uid && euid != uid) {
                 printf(" euid=%d", euid)
                 pw = getpwuid(euid)
                 pr_first_field(pw)
             }

             if (print_gid)
                 printf(" gid=%d", gid)
             pw = getgrgid(gid)
             pr_first_field(pw)

             if (print_gid && egid != gid) {
                 printf(" egid=%d", egid)
                 pw = getgrgid(egid)
                 pr_first_field(pw)
             }

             if (print_groups) {
                 for (i = 1; ("group" i) in PROCINFO; i++) {
                     if (i == 1)
                         printf(" groups=")
                     group = PROCINFO["group" i]
                     printf("%d", group)
                     pw = getgrgid(group)
                     pr_first_field(pw)
                     if (("group" (i+1)) in PROCINFO)
                         printf(",")
                 }
             }

             print ""
         }

         function pr_first_field(str,  a)
         {
             if (str != "") {
                 split(str, a, ":")
                 printf("(%s)", a[1])
             }
         }
       #+END_SRC

       #+RESULTS:
       : uid=1000(zv)(zv) groups=10(wheel),968(docker),977(wireshark),1000(zv)



